showcase/app/controllers/act_as_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1
---
  def create
    persona = User.find(params.expect(:id))