showcase/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1
---
  def acting_as
    id = session[:acting_as_id]
    return unless id

    User.find_by(id: id) || clear_stale_acting_as