showcase/app/controllers/projects_controller.rb

    def set_project
      @project ||= Project.find(params.expect(:id))
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1