showcase/app/controllers/reports_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (1, 2, 3)
SELECT "reports".* FROM "reports" ORDER BY "reports"."id" ASC
---
  def index
    @reports = Report.includes(:project, :requested_by, :approved_by).order(:id)

SELECT "projects".* FROM "projects" ORDER BY "projects"."name" ASC
---
  def new
    @report = Report.new(project_id: params[:project_id])
    @projects = Project.order(:name)

SELECT "reports".* FROM "reports" WHERE "reports"."id" = 2 LIMIT 1
---
    def set_report
      @report ||= Report.find(params.expect(:id))