showcase/app/controllers/users_controller.rb

  def index
    @users = User.order(:email_address)
    # Preload the org role (one per subject) and scoped roles per user so the
    # roster doesn't N+1 across every row.
    @org_roles = CurrentScope::RoleAssignment.where(subject_type: "User")
                   .includes(:role).index_by(&:subject_id)
    @scoped_roles = CurrentScope::ScopedRoleAssignment.where(subject_type: "User")
                      .includes(:role, :resource).group_by(&:subject_id)

    return unless CurrentScope.resolver.full_access?(current_scope_user)

    @beat_owner    = User.find_by(email_address: BEAT_OWNER_EMAIL)
    @beat_approver = User.find_by(email_address: BEAT_APPROVER_EMAIL)
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = 'owner@example.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email_address" = 'expenses.approver@example.com' LIMIT 1