showcase/app/controllers/walkthrough_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email_address" = 'payroll.preparer@example.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email_address" = 'payroll.approver@example.com' LIMIT 1
SELECT "pay_runs".* FROM "pay_runs" WHERE "pay_runs"."prepared_by_id" = 8 LIMIT 1
---
  def show
    @step = STEPS.include?(params[:step]) ? params[:step] : "intro"
    @preparer = User.find_by(email_address: PREPARER_EMAIL)
    @approver = User.find_by(email_address: APPROVER_EMAIL)
    @pay_run  = @preparer && PayRun.find_by(prepared_by: @preparer)