demo/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
---
    def set_project
      @project ||= Project.find(params.expect(:id))