demo/app/controllers/reports_controller.rb

  def index
    @reports = Report.includes(:project, :requested_by, :approved_by).order(:id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (1, 2, 3)
SELECT "reports".* FROM "reports" ORDER BY "reports"."id" ASC

  def new
    @report = Report.new(project_id: params[:project_id])
    @projects = Project.order(:name)
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."name" ASC

  def create
    @report = Report.new(report_params.merge(requested_by: Current.user))

    if @report.save
---
INSERT INTO "reports" ("approved_at", "approved_by_id", "created_at", "project_id", "requested_by_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def set_report
      @report ||= Report.find(params.expect(:id))
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = 2 LIMIT 1