showcase/app/jobs/sandbox_reset_job.rb

DELETE FROM "current_scope_scoped_role_assignments"
DELETE FROM "current_scope_role_assignments"
DELETE FROM "current_scope_role_permissions"
DELETE FROM "current_scope_roles" WHERE "current_scope_roles"."id" NOT IN (1, 2, 3, 4, 5, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
DELETE FROM "pay_runs" WHERE "pay_runs"."id" NOT IN (1, 2, 3)
DELETE FROM "contracts" WHERE "contracts"."id" NOT IN (1, 2, 3)
DELETE FROM "expense_claims" WHERE "expense_claims"."id" NOT IN (1, 2, 3)
DELETE FROM "current_scope_events"
---
  def perform
    # ponytail: one transaction, and NO bcrypt inside it — seeded users are
    # found (never recreated), so the txn stays well under SQLite's ~5s busy
    # timeout even while a request holds the write lock.
    ActiveRecord::Base.transaction do
      # 1. Clear ALL authorization grants first, in FK-safe order. This is what
      #    makes the killer case safe: a visitor-created role that was assigned
      #    to a user has its assignment removed here, BEFORE the role in step 3.
      CurrentScope::ScopedRoleAssignment.delete_all
      CurrentScope::RoleAssignment.delete_all
      CurrentScope::RolePermission.delete_all

      # 2. Restore canonical state: recreates deleted seed records, reverts
      #    mutated ones, and rebuilds every seed grant against current records.
      seeded = Showcase::Seeds.plant!

      # 3. Delete everything a visitor added (roles now carry no grants → FK-safe)
      #    and every visitor-created / renamed-away domain record.
      CurrentScope::Role.where.not(id: seeded[:role_ids]).delete_all
      PayRun.where.not(id: seeded[:pay_runs]).delete_all
      Contract.where.not(id: seeded[:contracts]).delete_all
      ExpenseClaim.where.not(id: seeded[:expense_claims]).delete_all
      # Reports before Projects: reports carry an FK to projects, so a
      # visitor-created report must go before the project it may point at.
      Report.where.not(id: seeded[:reports]).delete_all
      Project.where.not(id: seeded[:projects]).delete_all

      # 4. Clear the append-only ledger LAST. delete_all is the sanctioned bypass
      #    of Event#readonly? (SQLite has no TRUNCATE) — see the Event header.
      CurrentScope::Event.delete_all