showcase/lib/showcase/seeds.rb

SELECT "projects".* FROM "projects" WHERE "projects"."name" = 'Apollo' LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."name" = 'Zephyr' LIMIT 1
---
      def plant!
        @roles = []

        # The role-less account every anonymous hit is auto-signed-in as.
        User.visitor

        owner    = user("owner@example.com")
        reviewer = user("reviewer@example.com")
        member   = user("member@example.com")
        scoped   = user("scoped@example.com")

        CurrentScope.seed_defaults!
        owner_role  = track(CurrentScope::Role.find_by!(name: "Owner"))
        # seed_defaults! only sets full_access on CREATE, so re-assert it here to
        # heal a visitor who unchecked it while acting as Owner (which would 403
        # the management UI for everyone until the next reset).
        owner_role.update!(full_access: true)
        member_role = role("Member", %w[
          projects#index projects#show
          reports#index reports#show reports#new reports#create
        ])
        reviewer_role = role("Reviewer", member_role.permission_keys + %w[reports#approve])
        lister_role   = role("Lister", %w[projects#index reports#index])
        viewer_role   = role("Viewer", %w[reports#show])

        assign(owner => owner_role, reviewer => reviewer_role,
               member => member_role, scoped => lister_role)

        apollo = Project.find_or_create_by!(name: "Apollo")
        zephyr = Project.find_or_create_by!(name: "Zephyr")

SELECT "users".* FROM "users" WHERE "users"."email_address" = 'owner@example.com' LIMIT 1
---
      def user(email)
        User.find_or_create_by!(email_address: email) { |u| u.password = PASSWORD }

INSERT INTO "current_scope_role_assignments" ("subject_type", "subject_id", "role_id", "created_at", "updated_at") VALUES ('User', 1, 1, '2026-07-11 02:06:41.583425', '2026-07-11 02:06:41.583425') RETURNING "id"
---
      def assign(pairs)
        pairs.each do |subject, role|
          CurrentScope::RoleAssignment.find_or_create_by!(subject: subject) { |a| a.role = role }

INSERT INTO "current_scope_scoped_role_assignments" ("subject_type", "subject_id", "role_id", "resource_type", "resource_id", "created_at", "updated_at") VALUES ('User', 4, 5, 'Report', 1, '2026-07-11 02:06:41.624052', '2026-07-11 02:06:41.624052') RETURNING "id"
---
      def scoped_grant(subject, role, resource)
        CurrentScope::ScopedRoleAssignment.find_or_create_by!(subject: subject, role: role, resource: resource)

SELECT "reports".* FROM "reports" WHERE "reports"."title" = 'Q3 budget' LIMIT 1
UPDATE "reports" SET "approved_by_id" = NULL, "approved_at" = NULL, "updated_at" = '2026-07-11 02:32:04.151302' WHERE "reports"."id" = 1
---
      def report(title, project:, requested_by:)
        r = Report.find_or_create_by!(title: title) { |x| x.project = project; x.requested_by = requested_by }
        r.update!(project: project, requested_by: requested_by, approved_by: nil, approved_at: nil)

INSERT INTO "current_scope_role_assignments" ("subject_type", "subject_id", "role_id", "created_at", "updated_at") VALUES ('User', 8, 9, '2026-07-11 02:06:41.636585', '2026-07-11 02:06:41.636585') RETURNING "id"
---
      def assign_user(email, role)
        subject = user(email)
        CurrentScope::RoleAssignment.find_or_create_by!(subject: subject) { |a| a.role = role }

SELECT "pay_runs".* FROM "pay_runs" WHERE "pay_runs"."label" = 'July salaries' LIMIT 1
UPDATE "pay_runs" SET "status" = 'pending', "approved_by_id" = NULL, "approved_at" = NULL, "updated_at" = '2026-07-11 02:32:04.190340' WHERE "pay_runs"."id" = 1
---
      def pay_run(label, period:, amount:, prepared_by:)
        r = PayRun.find_or_create_by!(label: label) { |x| x.period = period; x.amount = amount; x.prepared_by = prepared_by }
        r.update!(period: period, amount: amount, prepared_by: prepared_by, **unapproved)

SELECT "contracts".* FROM "contracts" WHERE "contracts"."title" = 'Cloud hosting renewal' LIMIT 1
UPDATE "contracts" SET "status" = 'pending', "approved_by_id" = NULL, "approved_at" = NULL, "updated_at" = '2026-07-11 02:06:12.749582' WHERE "contracts"."id" = 2
---
      def contract(title, counterparty:, amount:, raised_by:)
        r = Contract.find_or_create_by!(title: title) { |x| x.counterparty = counterparty; x.amount = amount; x.raised_by = raised_by }
        r.update!(counterparty: counterparty, amount: amount, raised_by: raised_by, **unapproved)

SELECT "expense_claims".* FROM "expense_claims" WHERE "expense_claims"."description" = 'Conference travel' LIMIT 1
UPDATE "expense_claims" SET "status" = 'pending', "approved_by_id" = NULL, "approved_at" = NULL, "updated_at" = '2026-07-11 02:06:12.804900' WHERE "expense_claims"."id" = 2
---
      def expense_claim(description, amount:, submitted_by:)
        r = ExpenseClaim.find_or_create_by!(description: description) { |x| x.amount = amount; x.submitted_by = submitted_by }
        r.update!(amount: amount, submitted_by: submitted_by, **unapproved)